var $ = jQuery.noConflict();

// Определение используемых компонентов
const About = {
    props: ['url', 'about', 'param'],
    data: function () {
        return {
            aboutLabel: this.param
        }
    },
    methods:{
        setAbout: function (label) {
            this.aboutLabel = label;
        }
    },
    updated: function() {

    },
    template: `
        <div class="row" id="about">
               <div class="col-12">
                   <div class="row justify-content-center">
                       <p class="col-12 header-text text-center contacts-text-spacing">О НАС</p>
                   </div>
                   <br>
               </div>
               <div class="col-sm-12 col-md-4 reset-padding-right">
                   <div class="list-group sidebar-border">
                       <a href="javascript:void(0)" class="list-group-item content-sidebar-font content-sidebar-height content-sidebar-border" @click="setAbout('description')">
                           О нас
                           <div class="arrows-right">
                               <div class="hidden-md-down">
                                   <img class="img-fluid" v-bind:src=" url + '/image/arrows.png'" height="auto" width="10rem"/>
                               </div>
                           </div>
                       </a>
                       <a href="javascript:void(0)" class="list-group-item content-sidebar-font content-sidebar-height content-sidebar-border" @click="setAbout('agreement')">
                           Пользовательское соглашение
                           <div class="arrows-right">
                               <div class="hidden-md-down">
                                   <img class="img-fluid" v-bind:src=" url + '/image/arrows.png'" height="auto" width="10rem"/>
                               </div>
                           </div>
                       </a>
                       <a href="javascript:void(0)" class="list-group-item content-sidebar-font content-sidebar-height content-sidebar-border" @click="setAbout('prohibited')">
                           Товары, запрещенные к перемещению
                           <div class="arrows-right">
                               <div class="hidden-md-down">
                                   <img class="img-fluid" v-bind:src=" url + '/image/arrows.png'" height="auto" width="10rem"/>
                               </div>
                           </div>
                       </a>
                       <a href="javascript:void(0)" class="list-group-item content-sidebar-font content-sidebar-height content-sidebar-border" @click="setAbout('vacancies')">
                           Вакансии
                           <div class="arrows-right">
                               <div class="hidden-md-down">
                                   <img class="img-fluid" v-bind:src=" url + '/image/arrows.png'" height="auto" width="10rem"/>
                               </div>
                           </div>
                       </a>
                       <a href="javascript:void(0)" class="list-group-item content-sidebar-font content-sidebar-height content-sidebar-border" @click="setAbout('orders')">
                           Как сделать заказ
                           <div class="arrows-right">
                               <div class="hidden-md-down">
                                   <img class="img-fluid" v-bind:src=" url + '/image/arrows.png'" height="auto" width="10rem"/>
                               </div>
                           </div>
                       </a>
                       <a href="javascript:void(0)" class="list-group-item content-sidebar-font content-sidebar-height content-sidebar-border" @click="setAbout('money')">
                           Как передать деньги
                           <div class="arrows-right">
                               <div class="hidden-md-down">
                                   <img class="img-fluid" v-bind:src=" url + '/image/arrows.png'" height="auto" width="10rem"/>
                               </div>
                           </div>
                       </a>
                   </div>
               </div>
               <div class="col-sm-12 col-md-8">
                   <div class="about-content-styles" align="justify">
                        <template v-if="this.aboutLabel == 'description'">
                            <p style="text-align: left">Добро пожаловать на наш сайт!</p>
                            <p align="justify">Добро пожаловать на наш сайт!
                                Здесь вы сможете самостоятельно выбрать необходимый товар прямо из интернет-магазинов России, при этом экономя свои деньги и не переплачивая за товар. Хотите приобрести бытовую технику, мебель, хозяйственные и строительные товары, электронику, а так же <span class="text-danger">отправить гарантийную технику на ремонт в сервисный центр РФ</span>  или что-то еще? Тогда вы зашли по адресу! Наша цель – максимально упростить и удешевить процесс покупки, сделать его простым, удобным и выгодным! Наша команда следует четко установленному девизу: «Быстро, удобно и без переплат». Обратите внимание, что товар Вы покупаете по цене, которая указана в прайсе магазина. Приобретайте товары на нашем сайте, не выходя из дома, а наш курьер своевременно доставит Ваш заказ по указанному Вами адресу. Если при выборе товара у Вас возникнут вопросы – звоните или пишите нам! Мы дадим консультацию по любому Вашему вопросу!<br>
                                Удачных покупок!      
                        </template>
                        <template v-if="this.aboutLabel == 'prohibited'">
                            <p><h4 class="about-text-left">Товары, запрещенные к перемещению</h4></p>
                            <ol>
                                <li>Ювелирные изделия, драгоценные металлы и камни.</li>
                                <li>Антиквариат.</li>
                                <li>Наркотические вещества и психотропные препараты, их аналоги и прекурсоры, которые подлежат специальному контролю.</li>
                                <li>Огнестрельное оружие и его части, боеприпасы.</li>
                                <li>Асбест; огнеопасные, легковоспламеняющиеся и взрывные вещества, радиоактивные вещества, другие опасные грузы, с соответствующей маркировкой («невоспламеняющиеся газы», «окислитель», «инфекционные вещества», «самовозгорающиеся вещества», «яд», «радиоактивные вещества», «опасные вещества, при увлажнении», «вредные вещества», «ядовитый газ»).</li>
                                <li>Баллоны с жидкостью и газом.</li>
                                <li>Автомобильные аккумуляторы, аккумуляторы для мото- и с/х техники.</li>
                                <li>Порнографические материалы.</li>
                                <li>Животные (останки животных) и растения.</li>
                                <li>Продукты питания (скоропортящиеся продукты).</li>
                                <li>Грузы, которые требуют специального температурного режима.</li>
                                <li>Лекарственные препараты.</li>
                                <li>Грузы, которые имеют резкий запах, грязные и могут нанести вред другим грузам или нанести вред здоровью людей.</li>
                                <li>Товары и предметы, запрещенные Таможенным законодательством РФ.</li>
                            </ol>
                        </template>
                        <template v-if="this.aboutLabel == 'agreement'">
                            <div class="about-content-styles" align="justify">
                                <p class="text-center">ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ</p>
                                    Настоящее Соглашение пользователя (далее «Соглашение») заключается между Вами (далее «Пользователь») и ООО «АММА» (далее «Администратор») и регулирует все виды использования сайта   http://privozim.com  (далее «Сайт»), включая все его под-домены, который является собственностью и  управляется ООО «АММА».
                                    <br><br>
                                    <ol>
                                        <li>Общие положения</li>
                                    </ol>
                                    1.1. Использование сайта разрешено только лицу (далее «Пользователь»), что приняло все условия настоящего Соглашения, размещенной по адресу, http://privozim.com «Соглашение о конфиденциальности», которая размещена по адресу http://privozim.com и другие правила, предусмотренные на Сайте.<br>
                                    1.2. Пользователь обязан внимательно ознакомиться с Соглашением перед использованием Сайта. Используя любую часть Сайта, Пользователь дает свое согласие быть связанным условиями настоящего Соглашения с ООО «АММА».<br>
                                    Если Вы не согласны с условиями Соглашения (полностью или частично), то Вам не предоставляется статус и права пользователя и Вам запрещается использовать Сайт, включая, но не ограничиваясь, любую информацию, размещенную на Сайте и любые сервисы, предоставляемые в рамках Сайта.<br>
                                    1.3. Условия Соглашения распространяются на всех пользователей сайта - как на пользователей, не имеющих учетной записи на Сайте (незарегистрированный пользователь), так и на пользователей, имеющих любую учетную запись, любого из доступных видов. Под учетной записью понимается совокупность информации о 
                                    пользователя и данных авторизации (логин, пароль).<br>
                                    1.4. Пользователь не имеет права использовать Сайт и не может принять условия Соглашения, если он не достиг установленного законом возраста, когда он имеет право заключать такие соглашения.<br>
                                    1.5. Доступ к персонализированным сервисам Сайта возможен только для зарегистрированного пользователя (что создал учетную запись) и с использованием данных авторизации.<br>
                                    1.6. Информация, содержащаяся на Сайте в виде отчетов, новостей, пресс-релизов и других информационных материалов, является актуальной на дату их составления. В связи с последующими событиями и по истечению времени некоторая информация может оказаться неполной или такой, что не соответствует действительности, однако после ее публикации ООО «АММА» не гарантирует оперативного изменения такой информации в связи с событиями, произошедшими.<br>
                                    1.7. На Сайте может содержаться информация о проектах, прогнозы или заявления, касается будущих мероприятий http://privozim.com В связи с этим Стороны соглашаются с тем, что такая информация носит предварительный характер и действительные события и обстоятельства могут существенно отличаться в результате воздействия различных факторов.<br>
                                    <br>
                                    <ol start="2">
                                        <li>Права, обязанности и ответственность сторон</li>
                                    </ol>
                                    2.1. Если Пользователь считает, что на Сайте присутствует информация, нарушающая его права, Пользователь обязан сообщить об этом ООО «АММА» и предоставить ему информацию, которая подтверждает данное нарушение прав. В случае если Пользователь предоставит ложную информацию о нарушении его прав, он
                                        несет полную ответственность за причиненный ущерб (включая расходы, пошлины и оплату адвокатских услуг).
                                    <br>
                                    2.2. Пользователю запрещается:
                                    <ul>
                                        <li>создавать несколько учетных записей на Сайте, если фактически они принадлежат одному и тому же лицу;</li>
                                        <li>совершать действия, направленные на введение других пользователей в заблуждение;</li>
                                        <li>предоставлять в пользование свою учетную запись и / или логин и пароль от учетной записи третьим лицам;</li>
                                        <li>регистрировать аккаунт от имени или вместо другого лица;</li>
                                        <li>использовать любые компьютерные программы для автоматизированного сбора информации на Сайте;</li>
                                        <li>осуществлять незаконный сбор, систематизацию, хранение или распространение персональной информации других пользователей;</li>
                                        <li>пытаться получить доступ к учетной записи и / или логина и пароля другого пользователя любым способом, включая, но не ограничиваясь, путем обмана, злоупотребления доверием, подбора логина и пароля;</li>
                                        <li>размещать информацию (включая любые материалы), что нарушает авторские права, права на знаки для товаров и услуг, права промышленной собственности и / или права на иные объекты интеллектуальной собственности, принадлежат ДЦ и / или третьим лицам;</li>
                                        <li>размещать информацию, нарушающую права и законные интересы третьих лиц (В том числе, размещение фотографий и видеороликов, основным объектом которых человек, если этот человек не давала согласия на размещение на Сайте фотографии или видео с ее участием)</li>
                                        <li>размещать материалы рекламного, эротического, порнографического или оскорбительного характера;</li>
                                        <li>способствовать или разжигать религиозную, расовую  или межнациональную вражду;</li>
                                        <li>совершать действия, нарушающие права и свободы, честь и достоинство любого лица;</li>
                                        <li>оскорблять любого;</li> 
                                        <li>использовать нецензурные выражения, даже если они маскируются другими символами (например звездочками);</li>
                                        <li>выходить за рамки заранее установленной темы Анкеты и диалога с пользователем:</li>
                                        <li>злоупотреблять размещением информации, которая не несет смысловой нагрузки;</li>
                                        <li>провоцировать, начинать и / или поддерживать текстовые диалоги, которые могут привести к конфликту между Пользователями и / или Администрацией Сайта • размещать компьютерные вирусы или программы, способные прервать или нарушить нормальную функциональность компьютерного оборудования и программного обеспечения, а также средств телекоммуникации любых человек.</li>
                                    </ul>
                                    2.3. Ответственность пользователей:
                                    <ul>
                                        <li>любые действия, совершенные с использованием учетной записи и / или его логина и пароля пользователя, считаются осуществленными этим Пользователем;</li>
                                        <li>за нарушение условий настоящего Соглашения, ООО «АММА» имеет право без предварительного уведомления блокировать доступ Пользователя к Сайту и / или удалить учетную запись пользователя;</li>
                                        <li>в случае размещения Пользователем на Сайте информации или осуществления других действий, не соответствующих условиям Соглашения, ООО «АММА» имеет право без уведомления по собственному усмотрению удалить полностью или частично размещенную Пользователем информацию, включая ту информацию, в отношении которой трудно определить ее соответствие Соглашению и / или законодательству, применяется;</li>
                                        <li>Пользователь самостоятельно отвечает за любое использование информации опубликованной на Сайте.</li>
                                    </ul>
                                    2.4. Ответственность ООО «АММА»:
                                    <ul>
                                        <li>не принимает на себя обязательств по принятию заказа превышающего  рублевый эквивалент,  равный 1 000.00 дол. США  и весом более 100 кг;</li>
                                        <li>не несет ответственности и не возмещает ущерб, прямой или косвенный, причиненный Пользователю или третьим лицам в результате невозможности использования сайта;</li>
                                        <li>не несет ответственности за содержание сайтов, не принадлежащие ей ссылку на которые могут присутствовать на Сайте, и не гарантирует их доступности, корректной работы и соответствия заявленной тематике;</li>
                                        <li>не принимает на себя обязательств по проверке, изменению и контроля информации, расположенной кем-либо, кроме ООО «АММА» на Сайте, не гарантирует и не несет ответственности за достоверность такой информации, ее законность, качество и соответствие конкретным запросам и потребностям Пользователей Сайта;</li>
                                        <li>не несет ответственности за использование третьими лицами информации, размещенной Пользователем на Сайте, включая ее копирование, воспроизведение и распространение, осуществленные как в рамках Сайта, так и иными возможными способами.</li>
                                    </ul>
                                    <ol start="3">
                                        <li>Интеллектуальная собственность</li>
                                    </ol>
                                    3.1. Настоящее Соглашение не передает Пользователю никаких имущественных прав на любые объекты интеллектуальной собственности ООО «АММА» или третьих лиц, если это явно не указано, и все права собственности в отношении такой собственности остаются исключительно за ООО «АММА» и / или соответствующей третьим лицом.<br>
                                    3.2. Пользователю запрещено любое использование в коммерческих целях любой информации и объектов интеллектуальной собственности, которые размещены на Сайте, без письменного разрешения на это соответствующего правообладателя.<br>
                                    3.3. При любом разрешенном использовании Пользователем информации, размещена на Сайте, Пользователь обязан хранить все авторские ссылки, имеющихся в информационных материалах, и указывать авторство и ссылка на сайт в каждом отдельном случае использования информации и произведений.<br>
                                    3.4. Пользователь, размещает на Сайте любую информацию, которая содержит объекты интеллектуальной собственности, включая, но не ограничиваясь, текст, графические изображения, аудио и видео продукцию, компьютерные программы, базы данных, знаки для товаров и услуг и т.д., гарантирует, что загрузка на Сайт, копирование и использование данной информации и / или объектов интеллектуальной собственности,<br>
                                    содержатся в ней, не будет нарушать прав третьих лиц.<br>
                                    3.5. Пользователь, загружая на сайт любые объекты интеллектуальной собственности, безвозмездно предоставляет ООО «АММА» неисключительные имущественные права на эти объекты, при условии их использования на некоммерческих основаниях. Предоставляемые Пользователем ООО «АММА» имущественные права не имеют территориального ограничения и предоставляются на весь срок действия авторских прав. Данные имущественные права включают в себя право на: воспроизведение произведений, публичное исполнение и публичное оповещение произведений, публичную демонстрацию и публичный показ, осуществление перевода, переработки, адаптации, аранжировки и другие подобные изменения произведений, включение произведений как составных частей в сборники, представление произведений в всеобщего сведения публики таким образом, что ее представители могут осуществить доступ к произведениям с любого места и в любое время по их собственному выбору.<br> 
                                    <br>
                                    <ol start="4">
                                        <li>Конфиденциальность</li>
                                    </ol>
                                    4.1. Пользователь подтверждает, что он ознакомился и полностью принял условия «Соглашения о конфиденциальности» между Пользователем и ООО «АММА», которая размещена по адресу  http://privozim.com<br> 
                                    4.2. В случае, если при использовании Сайта Пользователю любым способом стала известна информация относительно ООО «АММА» и / или третьих лиц, которая в соответствии с законодательством  относится к конфиденциальной и / или Коммерческой тайны, Пользователю запрещено хранить, использовать и<br>
                                    распространять такую информацию.<br>
                                    4.3. Пользователь понимает и соглашается с тем, что размещая на Сайте информацию, в отношении которой не предусмотрено ограничение доступа, любое третье лицо может получить доступ к этой информации с помощью сети Интернет.<br>
                                    <br>
                                    <ol start="5">
                                        <li>Другие условия</li>
                                    </ol>
                                    5.1. ООО «АММА» имеет право вносить изменения в настоящее Соглашение. Все внесенные в Соглашение изменения будут доступны в виде новой редакции Соглашения, по адресу http://privozim.com  В случае внесения в Соглашение существенных изменений, ООО «АММА» дополнительно сообщит Пользователя об этих изменениях по электронной почте, указанной Пользователем в аккаунте, и на сайте. Все изменения<br>
                                    Соглашения вступают в силу с момента их опубликования. Используя услуги или Сайт, Пользователь подтверждает согласие с новыми условиями Соглашения в действующей  редакции на момент использования Пользователем услуг или Сайта.<br>
                                    5.2. ООО «АММА» не несет ответственности за ущерб или убытки, которые понес Пользователь или третьи лица в результате ошибочного понимания или непонимание условий настоящего Соглашения, инструкций или указаний о порядке использования сайта, относительно порядка размещения данных и других технических вопросов.<br>
                                    5.3. Пользователь предоставляет ООО «АММА» право присылать ему сообщения содержащие информацию о Сайте, товарах  и услугах  ООО «АММА» или информацию рекламного характера.<br>
                                    5.4. В случае признания недействительной или неосуществимой любой части данного Соглашения, другие части Соглашения будут оставаться в силе. Отказ каждой из сторон от любого положения или условия данного Соглашения, или любое их нарушение не отменяет действие этого положения или условия.<br>
                                    5.5. Сайт предоставляется ООО «АММА» пользователям в том виде, в котором он был создан для достижения целей ООО «АММА». ООО «АММА» не гарантирует соответствие Сайта целям и ожиданиям Пользователя, его бесперебойную и безошибочную работу.<br>
                                    5.6. ООО «АММА» имеет право в одностороннем порядке изменять виды сервисов в рамках сайта.<br>
                                    5.7. ООО «АММА» может в любой момент и без уведомления Пользователя уступить свои права по данному Соглашению третьей стороне.<br> 
                                    5.8. В настоящее Соглашение и отношениям между ООО «АММА» и Пользователем, возникающие в связи с использованием Сайта,  применяется законодательство ДНР.<br>
                           </div>
                        </template>
                        <template v-if="this.aboutLabel== 'vacancies'">
                        <div class="about-content-styles">
                            {{ this.about['vacancies'] }}
                        </div>
                        </template>
                        <template v-if="this.aboutLabel== 'orders'">
                            <div class="row">
                                <div class="col-6">
                                    <img v-bind:src=" url + '/image/about/step-1.png'" class="img-fluid about-img-margin-bottom"/>
                                </div>
                                <div class="col-12">
                                    <div class="row">
                                        <div class="col-2">
                                            <img v-bind:src=" url + '/image/about/a.png'" class="img-fluid"/>
                                        </div>
                                        <div class="col-10">
                                            <div class="row">
                                                <div class="col-12">
                                                    <span>Выбрать на сайте privozim.com «Категорию товара»</span>
                                                </div>
                                                <div class="row">
                                                    <div class="col-12">
                                                        <img v-bind:src=" url + '/image/about/img-step-1.png'" class="img-fluid about-img-margin-bottom"/>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                                <div class="col-12">
                                    <div class="row">
                                        <div class="col-2">
                                            <img v-bind:src=" url + '/image/about/b.png'" class="img-fluid"/>
                                        </div>
                                        <div class="col-10">
                                            <div class="row">
                                                <div class="col-12">
                                                    <span>Перейти в один из магазинов (навести курсор мышки и кликнуть по нему</span>
                                                </div>
                                                <div class="row">
                                                    <div class="col-12">
                                                        <img v-bind:src=" url + '/image/about/img-step-2.png'" class="img-fluid about-img-margin-bottom"/>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                                <div class="col-12">
                                    <div class="row">
                                        <div class="col-2">
                                            <img v-bind:src=" url + '/image/about/v.png'" class="img-fluid"/>
                                        </div>
                                        <div class="col-10">
                                            <div class="row">
                                                <div class="col-12">
                                                    <span>Найти на сайте магазина интересующий Вас товар, устраивающий по цене и качеству (в корзину магазина не заходить)</span>
                                                </div>
                                                <div class="row">
                                                    <div class="col-12">
                                                        <img v-bind:src=" url + '/image/about/img-step-3.png'" class="img-fluid about-img-margin-bottom"/>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                                <div class="col-12">
                                    <div class="row">
                                        <div class="col-2">
                                            <img v-bind:src=" url + '/image/about/g.png'" class="img-fluid"/>
                                        </div>
                                        <div class="col-10">
                                            <div class="row">
                                                <div class="col-12">
                                                    <span>Не заходя в корзину магазина, скопировать ссылку на товар</span>
                                                </div>
                                                <div class="row">
                                                    <div class="col-12">
                                                        <img v-bind:src=" url + '/image/about/img-step-4.png'" class="img-fluid about-img-margin-bottom"/>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                                <div class="col-6">
                                    <img v-bind:src=" url + '/image/about/step-2.png'" class="img-fluid about-img-margin-bottom"/>
                                </div>
                                <div class="col-12">
                                    <div class="row">
                                        <div class="col-2">
                                            <img v-bind:src=" url + '/image/about/a.png'" class="img-fluid"/>
                                        </div>
                                        <div class="col-10">
                                            <div class="row">
                                                <div class="col-12">
                                                    <span>Вернуться на закладку сайта и  нажать кнопку «Оформить заказ»</span>
                                                </div>
                                                <div class="row">
                                                    <div class="col-12">
                                                        <img v-bind:src=" url + '/image/about/img-step-21.png'" class="img-fluid about-img-margin-bottom"/>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                                <div class="col-12">
                                    <div class="row">
                                        <div class="col-2">
                                            <img v-bind:src=" url + '/image/about/b.png'" class="img-fluid"/>
                                        </div>
                                        <div class="col-10">
                                            <div class="row">
                                                <div class="col-12">
                                                    <span>В открывшейся форме оформления заказа вставьте ссылку в соответствующую строку и заполните остальные поля</span>
                                                </div>
                                                <div class="row">
                                                    <div class="col-12">
                                                        <img v-bind:src=" url + '/image/about/img-step-22.png'" class="img-fluid about-img-margin-bottom"/>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                                <div class="col-12">
                                    <div class="row">
                                        <div class="col-2">
                                            <img v-bind:src=" url + '/image/about/v.png'" class="img-fluid"/>
                                        </div>
                                        <div class="col-10">
                                            <div class="row">
                                                <div class="col-12">
                                                    <span>Заполнив форму заказа, Вы получаете расчет с учетом стоимости товара и его доставки в ДНР</span>
                                                </div>
                                                <div class="row">
                                                    <div class="col-12">
                                                        <img v-bind:src=" url + '/image/about/img-step-23.png'" class="img-fluid about-img-margin-bottom"/>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                                <div class="col-12">
                                    <div class="row">
                                        <div class="col-2">
                                            <img v-bind:src=" url + '/image/about/g.png'" class="img-fluid"/>
                                        </div>
                                        <div class="col-10">
                                            <div class="row">
                                                <div class="col-12">
                                                    <span>Если Вам нужен еще один товар, кликните по кнопке «Добавить заказ» и вставьте ссылку на новый заказ и заполните дополнительные поля</span>
                                                </div>
                                                <div class="row">
                                                    <div class="col-12">
                                                        <img v-bind:src=" url + '/image/about/img-step-24.png'" class="img-fluid about-img-margin-bottom"/>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                                <div class="col-12">
                                    <div class="row">
                                        <div class="col-2">
                                            <img v-bind:src=" url + '/image/about/d.png'" class="img-fluid"/>
                                        </div>
                                        <div class="col-10">
                                            <div class="row">
                                                <div class="col-12">
                                                    <span>После завершения выбора товаров кликните по зеленой кнопке «Оформить заказ»</span>
                                                </div>
                                                <div class="row">
                                                    <div class="col-12">
                                                        <img v-bind:src=" url + '/image/about/img-step-25.png'" class="img-fluid about-img-margin-bottom"/>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                                <div class="col-6">
                                    <img v-bind:src=" url + '/image/about/step-3.png'" class="img-fluid about-img-margin-bottom"/>
                                </div>
                                <div class="col-12">
                                    <div class="row">
                                        <div class="col-2"></div>
                                        <div class="col-10">
                                            <div class="row">
                                                <div class="col-12">
                                                    <span>Наш менеджер свяжется с Вами для уточнения заказа и получения оплаты<br> Оплачиваете заказ в нашем офисе (или курьеру при доставке)</span>
                                                    
                                                </div>
                                                <div class="row">
                                                    <div class="col-12">
                                                        <img v-bind:src=" url + '/image/about/img-step-31.png'" class="img-fluid about-img-margin-bottom"/>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                                <div class="col-6">
                                    <img v-bind:src=" url + '/image/about/step-4.png'" class="img-fluid about-img-margin-bottom"/>
                                </div>
                                <div class="col-12">
                                    <div class="row">
                                        <div class="col-2"></div>
                                        <div class="col-10">
                                            <div class="row">
                                                <div class="col-12">
                                                    <span>Менеджер уточняет удобное время доставки и мы бесплатно доставляем заказ по Вашему адресу</span>
                                                </div>
                                                <div class="row">
                                                    <div class="col-12">
                                                        <img v-bind:src=" url + '/image/about/img-step-41.png'" class="img-fluid about-img-margin-bottom"/>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </template>
                        <template v-if="this.aboutLabel== 'money'">
                            <p class="text-left">
                                1. Из любого банка, банковского терминала или  платежной системы перечислите необходимую сумму на реквизиты Privozim.com (карта СберБанка)*: Номер карты Вы можете запросить у нашего менеджера на сайте или по телефонам.<br>  
                                <span class="text-danger">* комиссия банка, снимаемая при переводе, оплачивается Вами, согласно тарифам Вашего банка или платежной системы.</span><br>
                                2. После отправки денежных средств ОБЯЗАТЕЛЬНО зарегистрируйте свое денежное отправление в форме <a class="text-danger" href="javascript:void(0)" v-on:click="$emit('order')">оформления заказа</a>.<br>  
                                3. Выдача денежных средств осуществляется в <a class="text-danger" href="javascript:void(0)" v-on:click="$emit('contact')">офисе Privozim.com</a> (пн-пт с 9:00 до 17:00).<br><br>
                                Консультация по отправлению денежных средств из России можно получить у онлайн оператора или по телефонам, указанным на сайте.<br>
                                Расчет стоимости услуги Доставка можно рассчитать, воспользовавшись нашим <a class="text-danger" href="javascript:void(0)" onclick="$('#modal').modal()">КАЛЬКУЛЯТОРОМ</a> .
                            </p>
                        </template>
                   </div>
               </div>
           </div>
    `
}


const Contact = {
    props: ['url', 'contacts'],
    template: `
        <div id="contact">
               <div class="row">
                   <div class="col-12">
                       <div class="row">
                           <div class="col-sm-12 col-md-4 contacts-text-gray contacts-border-right contacts-text-family">
                               ОФИС
                           </div>
                           <div class="col-sm-12 col-md-4 contacts-border-right contacts-text-family contacts-text-middle">
                               <p>{{ this.contacts['office']['address'] }}</p>
                               <template v-for="phone in contacts['office']['phone']">
                                    <p>{{ phone }}</p>
                               </template>
                               {{ this.contacts['office']['email'] }}
                           </div>
                           <div class="col-sm-12 col-md-4 contacts-text-family contacts-text-middle">
                               <p>Режим работы:</p>
                               <p class="contacts-text-large">{{ this.contacts['office']['mode'] }}</p>
                               <p class="contacts-text-lightgray">{{ this.contacts['office']['day'] }}</p>
                           </div>
                       </div>
                   </div>
               </div>
               <hr>
               <div class="row">
                   <div class="col-12">
                       <div class="col-12">
                           <iframe src="https://yandex.ua/map-widget/v1/?um=constructor%3A183bfd8b7197dfcd3766f05a851a069af75269c3858bb42b2ae7bc4427e2953c&amp;source=constructor" width="100%" height="400" frameborder="0"></iframe>
                       </div>
                   </div>
               </div>
               <hr>
               <div>
                   <div class="row">
                       <div class="col-12">
                           <div class="row">
                               <p class="col-12 text-center contacts-text-spacing">ГРУППЫ В СОЦИАЛЬНЫХ СЕТЯХ</p>
                           </div>
                           <br>
                       </div>
                   </div>
                   <div class="row">
                       <div class="col-12 text-center">
                           <a :href="this.contacts['facebook']">
                               <img v-bind:src=" url + '/image/facebook.png'" class="img-fluid content-img-padding" height="auto" width="80rem"/>
                           </a>
                           <a :href="this.contacts['vk']">
                               <img v-bind:src=" url + '/image/vk.png'" class="img-fluid content-img-padding" height="auto" width="80rem"/>
                           </a>
                       </div>
                   </div>
                   <br><hr>
               </div>
           </div>
    `
}

const Catalog = {
    template: `
        <!-- Catalog stores -->
        <div class="row" id="catalog">
                <div class="col-12">
                    <div class="row justify-content-center">
                        <p class="col-12 header-text text-center text-header-catalog">КАТАЛОГ ИНТЕРНЕТ-МАГАЗИНОВ РОССИИ</p>
                    </div>
                    <br>
                </div>
                <div class="col-12 justify-content-center">
                    <div class="table-responsive">
                        <table class="table table-striped text-catalog-font">
                            <tbody>
                                <template v-for="(item, index) in stores">
                                    <tr class="d-flex">
                                        <td class="col-5 col-md-3 justify-content-center text-center">
                                            <a :href="item['url']" class="not-link-a text-center" target="_blank">
                                                <img :src="url + '/image/store/' + item['image']" class="img-fluid" height="auto" width="100rem"/><br>
                                                <p class="catalog-store-text-size text-center">{{ item.name }}</p>
                                            </a>
                                        </td>
                                        <td class="col-7 col-md-9">
                                            <a :href="item['url']" class="not-link-a" target="_blank">
                                                <p class="text-catalog-padding catalog-store-text-size">{{ item.category }}</p>
                                            </a>
                                        </td>
                                    </tr>
                                </template>
                            </tbody>
                        </table>
                    </div>
                    <br>
                    <div class="col-12 text-center">
                        <button class="btn button-catalog btn-lg" @click="toggle">Оформить заказ</button>
                    </div>
                </div>
            </div>
    `,
    props: ['product', 'stores', 'url'],
    data: function () {
        return {
            array: [

            ]
        }
    },
	methods: {
        toggle: function () {
            this.$emit('ordervisible');
        }
    },
    mounted: function() {
        my = this;
        this.product.forEach(function(item, i, arr) {
            if(my.array[item.name] != null)
                my.array[item.name] = item.category_name;
            else
                my.array[item.name] += ", " + item.category_name;
        });
    }
}

const Order = {
    template: `
        <div class="row" id="order">
                <div class="col-md-8 offset-md-3">
                    <div class="row justify-content-center">
                        <p class="col-12"><h4>ОФОРМЛЕНИЕ ЗАКАЗА</h4>
                    </div>
                    <br>
                </div>
                <form @submit.prevent="sendOrder()" action="" class="col-md-8 offset-md-3">
                    <div>
                        <div class="row">
                            <div class="col">
                                <input type="text" class="form-control order-input-styles" placeholder="ФИО получателя" required v-model="fio">
                            </div>
                        </div>
                        <br>
                        <div class="row">
                            <div class="col">
                                <input type="tel" class="form-control order-input-styles" placeholder="Телефон" required v-model="fenix">
                            </div>
                            <div class="col">
                                <input type="email" class="form-control order-input-styles" placeholder="E-mail" v-model="email">
                            </div>
                        </div>
                        <br>
                        <div class="row">
                            <div class="col">
                                <input type="tel" class="form-control order-input-styles" placeholder="Телефон мессенджер" v-model="phone">
                            </div>
                            <div class="col">
                                <div class="form-check form-check-inline">
                                    <label class="form-check-label">
                                        <input class="form-check-input" type="checkbox" value="option1" v-model="viber">
                                        <img v-bind:src=" url + '/image/viber.png'" height="auto" width="22rem" />
                                    </label>
                                </div>
                                <div class="form-check form-check-inline">
                                    <label class="form-check-label">
                                        <input class="form-check-input" type="checkbox" value="option2" v-model="telegram">
                                        <img v-bind:src=" url + '/image/telegram.png'" height="auto" width="25rem" /></label>
                                </div>
                                <div class="form-check form-check-inline disabled">
                                    <label class="form-check-label">
                                        <input class="form-check-input" type="checkbox" value="option3" v-model="whatsapp">
                                        <img v-bind:src=" url + '/image/whatsapp.png'" height="auto" width="25rem"/></label>
                                </div>
                            </div>
                        </div>
                        <div class="row">
                            <div class="col-12 input-bottom calc-margin">
                                <div class="row">
                                    <div class="col-6">
                                        <select v-model="From" class="form-control order-input-styles order-select-height">
                                            <option disabled value="">Откуда</option>
                                            <option v-for="item in city" :value="item.id">
                                                {{ item.city }}
                                            </option>
                                        </select>
                                    </div>
                                    <div class="col-6">
                                        <select v-model="To" class="form-control order-input-styles order-select-height">
                                            <option disabled value="">Куда</option>
                                            <option v-for="item in city" :value="item.id">
                                                {{ item.city }}
                                            </option>
                                        </select>
                                    </div>
                                </div>
                            </div>
                            <div class="col">
                                <input type="text" class="form-control order-input-styles" placeholder="Адрес доставки" required v-model="address">
                            </div>
                        </div>
                        <div class="row justify-content-center">
                            <p class="col-12"><h5>ИНФОРМАЦИЯ О ЗАКАЗЕ</h5></p>
                        </div>
                        <div class="row justify-content-center text-center">
                            <p class="col-12 order-text-styles">Пожалуйста заполните пункты, которые относятся к Вашему заказу.</p>
                        </div>
                        <div class="row justify-content-center border-red">
                            <div class="col offset-1 text-center to-border text-danger card-font">
                                <p class="text-danger-styles">
                                    Всего можно заполнить до 10 заявок в одном заказе.
                                </p>
                            </div>
                        </div>
                        <br>
                        <div class="row" v-for="(order, index) in orders">
                            <div class="col-12 order-border-styles">
                                <div class="row form-group">
                                    <label class="col-3 col-form-label order-text-header-styles">ЗАКАЗ {{ index + 1 }}:</label>
                                </div>
                                <div class="row form-group">
                                    <div class="col-md-12" v-if="order['type'] == 'cargo' || order['type'] == 'tire'">
                                        <div class="input-group">
                                            <div class="input-group">
                                                <input type="url" class="form-control order-input-styles" placeholder="Ссылка" required v-model="order['order']">
                                            </div>
                                            <span class="order-box input-group-text justify-content-start align-self-center" data-toggle="popover" data-animation="false" data-trigger="hover" data-placement="top" data-content="Введите ссылку на страницу с требуемым заказом" href="javascript:void(0)">?</span>    
                                        </div>
                                    </div>
                                </div>
                                <div class=" row justify-content-center">
                                    <div class="col-2 offset-0 offset-md-1 form-check form-check-inline">
                                        <input class="form-check-input" type="radio" name="inlineRadioOptions" id="inlineRadio1" value="cargo" v-model="order['type']">
                                        <label class="form-check-label order-text-styles-small reset-order-padding-left" for="inlineRadio1">Товары</label>
                                    </div>
                                    <div class="col-2 offset-1 form-check form-check-inline">
                                        <input class="form-check-input" type="radio" name="inlineRadioOptions" id="inlineRadio2" value="tire" v-model="order['type']">
                                        <label class="form-check-label order-text-styles-small reset-order-padding-left" for="inlineRadio2">Шины/Диски</label>
                                    </div>
                                    <div class="col-3 col-md-2 offset-1 form-check form-check-inline">
                                        <input class="form-check-input" type="radio" name="inlineRadioOptions" id="inlineRadio3" value="document" v-model="order['type']">
                                        <label class="form-check-label order-text-styles-small reset-order-padding-left" for="inlineRadio3">Документы</label>
                                    </div>
                                    <div class="col-2 offset-1 form-check form-check-inline">
                                        <input class="form-check-input" type="radio" name="inlineRadioOptions" id="inlineRadio4" value="money" v-model="order['type']">
                                        <label class="form-check-label order-text-styles-small reset-order-padding-left" for="inlineRadio4">Деньги</label>
                                    </div>
                                    <div class="col-12">
                                        <br v-if="(order['type'] == 'cargo')||(order['type'] == 'money')">
                                        <div class="text-danger text-center" v-if="order['type'] == 'cargo'">
                                            Максимально допустимый вес - 100 кг.
                                        </div>
                                        <div class="text-danger text-center" v-if="(order['type'] == 'cargo') || (order['type'] == 'tire')">
                                            <p class="text-center">
                                                <a class="text-danger" href="javascript:void(0)" v-on:click="$emit('orders')">Как сделать заказ ?</a>
                                            </p>
                                        </div>
                                        <div class="text-center" v-if="order['type'] == 'money'">
                                            <p class="text-center">
                                                <a class="text-danger" href="javascript:void(0)" v-on:click="$emit('money')">Как передать деньги ?</a>
                                            </p>
                                        </div>
                                        <br>
                                    </div>
                                </div>
                                <div v-if="order['type'] == 'cargo'">
                                    <div class="row form-group">
                                        <label class="col-md-1 col-form-label small order-text-styles-small">Количество </label>
                                        <div class="col-md-3">
                                           <div class="input-group">
                                               <div class="input-group">
                                                    <input type="number" class="form-control order-input-styles" required v-model="order['amount']">
                                                    <span class="input-group-addon order-input-styles order-input-width">шт.</span>
                                               </div>
                                               <span class="order-box input-group-text justify-content-start align-self-center" data-toggle="popover" data-animation="false" data-trigger="hover" data-placement="top" data-content="Введите количество" href="javascript:void(0)">?</span>
                                           </div>
                                        </div>
                                         <label class="col-md-1 col-form-label small order-text-styles-small">Вес </label>
                                        <div class="col-md-3">
                                            <div class="input-group">
                                                <div class="input-group">
                                                    <input type="number" class="form-control order-input-styles" v-model="order['weight']">
                                                    <span class="input-group-addon order-input-styles order-input-width">кг.</span>
                                                </div>
                                                <span class="order-box input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="popover" data-trigger="hover" data-placement="top" data-content="Введите фактический вес (кг)" href="javascript:void(0)">?</span>
                                            </div>
                                        </div>
                                        <label class="col-md-1 col-form-label small order-text-styles-small">Сумма </label>
                                        <div class="col-md-3">
                                            <div class="input-group">
                                                <div class="input-group">
                                                    <input type="number" class="form-control order-input-styles" required v-model="order['sum']">
                                                    <span class="input-group-addon order-input-styles order-input-width">руб.</span>
                                                </div>
                                                <span class="order-box input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="popover" data-trigger="hover" data-placement="top" data-content="Введите фактическую стоимость заказа" href="javascript:void(0)">?</span>
                                            </div>
                                        </div>
                                    </div>
                                    <div class="row form-group">
                                        <label class="col-md-1 col-form-label small order-text-styles-small">Длина</label>
                                        <div class="col-md-3">
                                            <div class="input-group">
                                                <div class="input-group">
                                                    <input type="number" class="form-control order-input-styles" v-model="order['len']">
                                                    <span class="input-group-addon order-input-styles order-input-width">см.</span>
                                                </div>
                                                <span class="order-box-hidden input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="" data-trigger="hover" data-placement="top" data-content="Введите длину (см)" href="javascript:void(0)"></span>
                                            </div>
                                        </div>
                                        <label class="col-md-1 col-form-label small order-text-styles-small">Ширина</label>
                                        <div class="col-md-3">
                                            <div class="input-group">
                                                <div class="input-group">
                                                    <input type="number" class="form-control order-input-styles" v-model="order['width']">
                                                    <span class="input-group-addon order-input-styles order-input-width">см.</span>
                                                </div>
                                                <span class="order-box-hidden input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="popover" data-trigger="hover" data-placement="top" data-content="Введите ширину (см)" href="javascript:void(0)"></span>
                                            </div>
                                        </div>
                                        <label class="col-md-1 col-form-label small order-text-styles-small">Высота</label>
                                        <div class="col-md-3">
                                            <div class="input-group">
                                            <div class="input-group">
                                                <input type="number" class="form-control order-input-styles" v-model="order['height']">
                                                <span class="input-group-addon order-input-styles order-input-width">см.</span>
                                            </div>
                                            <span class="order-box input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="popover" data-trigger="hover" data-placement="top" data-content="Если груз объемный, введите габариты (см)" href="javascript:void(0)">?</span>
                                        </div>
                                        </div>
                                    </div>
                                    <div class="row order-text-styles">
                                        <div class="col-2 col-md-1 align-self-center col-form-label small order-text-styles-small">
                                                Подъем на
                                        </div>
                                        <div class="col-6 col-md-3 align-self-right">
                                            <div class="input-group">
                                                <div class="input-group">
                                                    <input type="number" class="form-control order-input-styles" min="0" value="0" v-model="order['floor_user']">
                                                    <span class="input-group-addon order-input-styles">этаж</span>
                                                </div>
                                                <span class="order-box input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="popover" data-trigger="hover" data-placement="top" data-content="Введите номер  этажа, на который необходимо доставить заказ. Услуга платная, если суммарный фактический или объемный вес Вашего заказа более 30 кг и отсутствует грузовой лифт. Первый этаж – бесплатно." href="javascript:void(0)">?</span>
                                            </div>
                                        </div>
                                        <div class="col-1 align-self-center align-bottom form-check">
                                            <input class="form-check-input" type="checkbox" value="" id="defaultCheck1" v-model="order['pLift']">
                                            <label class="form-check-label small order-text-styles-small" for="defaultCheck1">
                                                Лифт
                                            </label>
                                        </div>
                                        <div class="col-10 col-sm-3 offset-2 offset-sm-1 align-self-center align-bottom form-check" v-show="order['pLift']">
                                            <input class="form-check-input" type="checkbox" value="" id="defaultCheck1" v-model="order['lift']">
                                            <label class="form-check-label small order-text-styles-small" for="defaultCheck1">
                                                Грузовой лифт
                                            </label>
                                        </div>
                                    </div>
                                    <div class="row">
                                        <div class="col-10 col-sm-4 offset-2 offset-sm-1 align-self-center">
                                                <div class="form-check input-group">
                                                    <input type="checkbox" class="form-check-input" id="check2" value="brittle" v-model="order['fragile']">
                                                    <label class="form-check-label small order-text-styles-small" for="check2">Хрупкий груз</label>
                                                    <span class="order-box input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="popover" data-trigger="hover" data-placement="top" data-content="«Хрупкий груз» доставляется с особой осторожностью, исключающей порчу содержимого" href="javascript:void(0)">?</span>
                                                </div>
                                        </div>
                                    </div>
                                    <br>
                                    <div class="row form-group">
                                        <div class="col-md-12">
                                            <textarea class="form-control order-input-styles" v-model="order['description']" placeholder="Укажите дополнительную информацию по данному заказу (цвет, размер и т.д.)"></textarea>
                                        </div>
                                    </div>
                                    <hr>
                                    <div class="row">
                                        <div class="col-11 col-md-9 offset-1 offset-md-3">
                                            <div class="form-check">
                                                <p class="order-text-styles"><h4>Итого по Заказу {{ index + 1 }} :  {{ round10(Number(order['sum']) + total_delivery(Number(order['len']), Number(order['width']), Number(order['height']), Number(order['weight'])) + total_expedition(Number(order['len']), Number(order['width']), Number(order['height']), Number(order['weight']), Number(order['sum'])) + insurance(Number(order['sum'])) + total_fragile(Number(order['fragile'])) + total_floor(Number(order['len']), Number(order['width']), Number(order['height']), Number(order['weight']), Number(order['floor_user']), order['lift'], order['pLift']), 0) }} руб. </h4></p>
                                            </div>
                                        </div>
                                        <div class="col-11 col-md-9 offset-1 offset-md-3 description-total order-text-styles">
                                            <h7>Включая:</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles">
                                            <h7>Сумма заказа: {{ round10(Number(order['sum']), 0) }} р.</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles">
                                            <h7>Доставка: {{ round10(total_delivery(Number(order['len']), Number(order['width']), Number(order['height']), Number(order['weight'])) + total_expedition(Number(order['len']), Number(order['width']), Number(order['height']), Number(order['weight']), Number(order['sum'])), 0) }} р.</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles">
                                            <h7>Страховой сбор: {{ round10(insurance(Number(order['sum'])), 0) }} р.</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles">
                                            <h7>Хрупкий груз: {{ total_fragile(Number(order['fragile'])) }} р.</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles">
                                            <h7>Подъем на этаж: {{ round10(total_floor(Number(order['len']), Number(order['width']), Number(order['height']), Number(order['weight']), Number(order['floor_user']), order['lift'], order['pLift']), 0)  }} р.</h7>
                                        </div>
                                    </div>
                                </div>
                                <div v-if="order['type'] == 'tire'">
                                    <div class="row form-group">
                                        <label class="col-md-1 col-form-label small order-text-styles-small">Количество </label>
                                        <div class="col-md-3">
                                           <div class="input-group">
                                               <div class="input-group">
                                                    <input type="number" class="form-control order-input-styles" required v-model="order['amount']">
                                                    <span class="input-group-addon order-input-styles order-input-width">шт.</span>
                                               </div>
                                               <span class="order-box input-group-text justify-content-start align-self-center" data-toggle="popover" data-animation="false" data-trigger="hover" data-placement="top" data-content="Введите количество" href="javascript:void(0)">?</span>
                                           </div>
                                        </div>
                                         <label class="col-md-1 col-form-label small order-text-styles-small">Диаметр </label>
                                         <div class="col-md-3">
                                            <div class="input-group">
                                                <div class="input-group">
                                                     <select v-model="order['selectTires']" class="form-control border-color-green" required>
                                                        <option value="14">
                                                            < R14
                                                        </option>
                                                        <option value="16">
                                                            < R16
                                                        </option>
                                                        <option value="18">
                                                            < R18
                                                        </option>
                                                        <option value="19">
                                                            > R18
                                                        </option>
                                                     </select>
                                                </div>
                                                <span class="order-box input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="popover" data-trigger="hover" data-placement="top" data-content="Выберите ориентировочный диаметр шины или диска" href="javascript:void(0)">?</span>
                                            </div>
                                        </div>
                                        <label class="col-md-1 col-form-label small order-text-styles-small">Сумма </label>
                                        <div class="col-md-3">
                                            <div class="input-group">
                                                <div class="input-group">
                                                    <input type="number" class="form-control order-input-styles" required v-model="order['sum']">
                                                    <span class="input-group-addon order-input-styles order-input-width">руб.</span>
                                                </div>
                                                <span class="order-box input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="popover" data-trigger="hover" data-placement="top" data-content="Введите фактическую стоимость заказа" href="javascript:void(0)">?</span>
                                            </div>
                                        </div>
                                    </div>
                                    <div class="row order-text-styles">
                                        <div class="col-2 col-md-1 align-self-center col-form-label small order-text-styles-small">
                                                Подъем на
                                        </div>
                                        <div class="col-5 col-md-3 align-self-right">
                                            <div class="input-group">
                                                <div class="input-group">
                                                    <input type="number" class="form-control order-input-styles" min="0" value="0" v-model="order['floor_user']">
                                                    <span class="input-group-addon order-input-styles">этаж</span>
                                                </div>
                                                <span class="order-box input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="popover" data-trigger="hover" data-placement="top" data-content="Введите номер  этажа, на который необходимо доставить заказ. Услуга платная, если суммарный фактический или объемный вес Вашего заказа более 30 кг и отсутствует грузовой лифт. Первый этаж – бесплатно." href="javascript:void(0)">?</span>
                                            </div>
                                        </div>
                                        <div class="col-1 offset-1 offset-sm-0 align-self-center align-bottom form-check">
                                            <input class="form-check-input" type="checkbox" value="" id="defaultCheck1" v-model="order['pLift']">
                                            <label class="form-check-label small order-text-styles-small" for="defaultCheck1">
                                                Лифт
                                            </label>
                                        </div>
                                        <div class="col-10 col-sm-3 offset-2 offset-sm-1 align-self-center align-bottom form-check" v-show="order['pLift']">
                                            <input class="form-check-input" type="checkbox" value="" id="defaultCheck1" v-model="order['lift']">
                                            <label class="form-check-label small order-text-styles-small" for="defaultCheck1">
                                                Грузовой лифт
                                            </label>
                                        </div>
                                    </div>
                                    <div class="row">
                                        <div class="col-10 col-sm-4 offset-2 offset-sm-1 align-self-center">
                                            <div class="form-check input-group">
                                                <input type="checkbox" class="form-check-input" id="check2" value="brittle" v-model="order['fragile']">
                                                <label class="form-check-label small order-text-styles-small" for="check2">Хрупкий груз</label>
                                                <span class="order-box input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="popover" data-trigger="hover" data-placement="top" data-content="«Хрупкий груз» доставляется с особой осторожностью, исключающей порчу содержимого" href="javascript:void(0)">?</span>
                                            </div>
                                        </div>
                                    </div>
                                    <br>
                                    <div class="row form-group">
                                        <div class="col-md-12">
                                            <textarea class="form-control order-input-styles" v-model="order['description']" placeholder="Укажите дополнительную информацию по данному заказу (цвет, размер и т.д.)"></textarea>
                                        </div>
                                    </div>
                                    <hr>
                                    <div class="row">
                                        <div class="col-11 col-md-9 offset-1 offset-md-3">
                                            <div class="form-check">
                                                <p class="order-text-styles"><h4>Итого по Заказу {{ index + 1 }}:  {{ round10(Number(order['sum']) + total_tires(Number(order['amount']), Number(order['selectTires'])) + insurance(Number(order['sum'])) + total_fragile(Number(order['fragile'])) + total_floor_tires(Number(order['amount']), Number(order['floor_user']), order['lift'], order['pLift']), 0) }} руб. </h4></p>
                                            </div>
                                        </div>
                                        <div class="col-11 col-md-9 offset-1 offset-md-3 description-total order-text-styles">
                                            <h7>Включая:</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles">
                                            <h7>Сумма заказа: {{ round10(Number(order['sum']), 0) }} р.</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles" v-show="total_fragile != 0">
                                            <h7>Доставка: {{ round10(total_tires(Number(order['amount']), Number(order['selectTires'])), 0) }} р.</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles">
                                            <h7>Страховой сбор: {{ round10(insurance(Number(order['sum'])), 0) }} р.</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles">
                                            <h7>Хрупкий груз: {{ total_fragile(Number(order['fragile'])) }} р.</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles">
                                            <h7>Подъем на этаж: {{ round10(total_floor_tires(Number(order['amount']), Number(order['floor_user']), order['lift'], order['pLift']), 0)  }} р.</h7>
                                        </div>
                                    </div>
                                </div>
                                <div v-if="order['type'] == 'document'">
                                    <div class="row form-group">
                                        <div class="col-12">
                                           <div class="input-group">
                                               <div class="input-group">
                                                    <input type="text" class="form-control order-input-styles" placeholder="ФИО отправителя" required v-model="order['fio_recip']">
                                               </div>
                                               <span class="order-box input-group-text justify-content-start align-self-center" data-toggle="popover" data-animation="false" data-trigger="hover" data-placement="top" data-content="Введите ФИО отправителя" href="javascript:void(0)">?</span>
                                           </div>
                                        </div>
                                    </div>
                                    <div class="row form-group">
                                        <label class="col-md-2 col-form-label small order-text-styles-small">Телефон отправителя </label>
                                        <div class="col-md-4">
                                           <div class="input-group">
                                               <div class="input-group">
                                                    <input type="phone" class="form-control order-input-styles" required v-model="order['phone_recip']">
                                               </div>
                                               <span class="order-box input-group-text justify-content-start align-self-center" data-toggle="popover" data-animation="false" data-trigger="hover" data-placement="top" data-content="Введите номер телефона отправителя" href="javascript:void(0)">?</span>
                                           </div>
                                        </div>
                                        <label class="col-md-2 col-form-label small order-text-styles-small">Оценочная стоимость</label>
                                        <div class="col-md-4">
                                            <div class="input-group">
                                                <div class="input-group">
                                                    <input type="number" class="form-control order-input-styles" required v-model="order['sum']">
                                                    <span class="input-group-addon order-input-styles order-input-width">руб.</span>
                                                </div>
                                                <span class="order-box input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="popover" data-trigger="hover" data-placement="top" data-content="Введите отправляемую сумму" href="javascript:void(0)">?</span>
                                            </div>
                                        </div>
                                    </div>
                                    <br>
                                    <div class="row form-group">
                                        <div class="col-3 offset-3">
                                            <input type="radio" id="copy" value="copy" v-model="order['copy']">
                                            <label for="copy">Копия</label>
                                        </div>
                                        <div class="col">
                                            <input type="radio" id="no-copy" value="original" v-model="order['copy']">
                                            <label for="no-copy">Оригинал</label>
                                        </div>
                                    </div>
                                    <div class="row form-group">
                                        <div class="col-md-12">
                                            <textarea class="form-control order-input-styles" v-model="order['description']" placeholder="Укажите дополнительную информацию"></textarea>
                                        </div>
                                    </div>
                                    <hr>
                                    <div class="row">
                                        <div class="col-11 col-md-9 offset-1 offset-md-3">
                                            <div class="form-check">
                                                <p class="order-text-styles"><h4>Итого по Заказу {{ index + 1 }}:  {{ round10(insurance_documents(Number(order['sum']), order['fio_recip'], order['phone_recip'], order['passport']) + total_documents(order['copy']), 0) }} руб. </h4></p>
                                            </div>
                                        </div>
                                        <div class="col-11 col-md-9 offset-1 offset-md-3 description-total order-text-styles">
                                            <h7>Включая:</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles" v-show="total_fragile != 0">
                                            <h7>Доставка: {{ round10(total_documents(order['copy']), 0) }} р.</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles">
                                            <h7>Страховой сбор: {{ round10(insurance_documents(Number(order['sum']), order['fio_recip'], order['phone_recip'], order['passport'])) }} р.</h7>
                                        </div>
                                    </div>
                                </div>
                                <div v-if="order['type'] == 'money'">
                                    <div class="row form-group">
                                        <div class="col-12">
                                           <div class="input-group">
                                               <div class="input-group">
                                                    <input type="text" class="form-control order-input-styles" placeholder="ФИО отправителя" required v-model="order['fio_recip']">
                                               </div>
                                               <span class="order-box input-group-text justify-content-start align-self-center" data-toggle="popover" data-animation="false" data-trigger="hover" data-placement="top" data-content="Введите ФИО отправителя" href="javascript:void(0)">?</span>
                                           </div>
                                        </div>
                                        <div class="col-12">
                                           <br>
                                           <div class="input-group">
                                               <div class="input-group">
                                                    <input type="text" class="form-control order-input-styles" placeholder="Чем отправлено (наименование Банка, электронного кошелька)" required v-model="order['bank']">
                                               </div>
                                               <span class="order-box input-group-text justify-content-start align-self-center" data-toggle="popover" data-animation="false" data-trigger="hover" data-placement="top" data-content="Укажите наименование Банка, электронного кошелька" href="javascript:void(0)">?</span>
                                           </div>
                                        </div>
                                        <div class="col-12">
                                           <br>
                                           <div class="input-group">
                                               <div class="input-group">
                                                    <input type="text" class="form-control order-input-styles" placeholder="Номер платежной квитанции" required v-model="order['passport']">
                                               </div>
                                               <span class="order-box input-group-text justify-content-start align-self-center" data-toggle="popover" data-animation="false" data-trigger="hover" data-placement="top" data-content="Введите номер платежной квитанции" href="javascript:void(0)">?</span>
                                           </div>
                                        </div>
                                    </div>
                                    <div class="row form-group">
                                        <label class="col-md-2 col-form-label small order-text-styles-small">Телефон отправителя </label>
                                        <div class="col-md-4">
                                           <div class="input-group">
                                               <div class="input-group">
                                                    <input type="phone" class="form-control order-input-styles" required v-model="order['phone_recip']">
                                               </div>
                                               <span class="order-box input-group-text justify-content-start align-self-center" data-toggle="popover" data-animation="false" data-trigger="hover" data-placement="top" data-content="Введите номер телефона отправителя" href="javascript:void(0)">?</span>
                                           </div>
                                        </div>
                                        <label class="col-md-2 col-form-label small order-text-styles-small">Отправляемая сумма </label>
                                        <div class="col-md-4">
                                            <div class="input-group">
                                                <div class="input-group">
                                                    <input type="number" class="form-control order-input-styles" required v-model="order['sum']">
                                                    <span class="input-group-addon order-input-styles order-input-width">руб.</span>
                                                </div>
                                                <span class="order-box input-group-text justify-content-start align-self-center" data-animation="false" data-toggle="popover" data-trigger="hover" data-placement="top" data-content="Введите отправляемую сумму" href="javascript:void(0)">?</span>
                                            </div>
                                        </div>
                                    </div>
                                    <br>
                                    <div class="row form-group">
                                        <div class="col-md-12">
                                            <textarea class="form-control order-input-styles" v-model="order['description']" placeholder="Укажите дополнительную информацию"></textarea>
                                        </div>
                                    </div>
                                    <hr>
                                    <div class="row">
                                        <div class="col-11 col-md-9 offset-1 offset-md-3">
                                            <div class="form-check">
                                                <p class="order-text-styles"><h4>Итого по Заказу {{ index + 1 }}:  {{ round10(Number(order['sum']) + total_money(Number(order['sum'])), 0) }} руб. </h4></p>
                                            </div>
                                        </div>
                                        <div class="col-11 col-md-9 offset-1 offset-md-3 description-total order-text-styles">
                                            <h7>Включая:</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles">
                                            <h7>Сумма заказа: {{ round10(Number(order['sum']), 0) }} р.</h7>
                                        </div>
                                        <div class="col-10 col-md-8 offset-2 offset-md-4 description-total order-text-styles" v-show="total_fragile != 0">
                                            <h7>Доставка: {{ round10(total_money(Number(order['sum'])), 0) }} р.</h7>
                                        </div>
                                    </div>
                                </div>    
                            </div>    
                    </div>
                        <div class="row text-center">
                        <div class="col-12 col-md-6">
                            <button type="button" class="btn btn-md button-add-styles button-shadow" @click="addOrder()"><p class="button-text-styles">+Добавить заказ</p></button>
                        </div>
                        <div class="col-12 col-md-6 align-self-center">
                            <button type="submit" class="btn btn-md button-order-styles button-shadow"><p class="button-text-styles">Оформить заказ</p></button>
                        </div>
                    </div>
                    <br>
                    <div class="row">
                        <div class="col-11 offset-1">
                            <div class="form-check">
                                <input type="checkbox" class="form-check-input" id="check2" v-model="agreement">
                                <label class="form-check-label text-danger" for="check2">Отправляя заказ Вы ознакомились и согласились с <ins>Пользовательским соглашением</ins></label>
                            </div>
                        </div>
                    </div>
                    <br>
                    <div class="row">
                        <div class="col-11 offset-1">
                            <div class="form-check">
                                <p class="order-text-styles"><h4 class="text-warning" id="notification"></h4></p>
                            </div>
                        </div>
                    </div>
                    <div class="row">
                        <div class="col-11 col-md-9 offset-1 offset-md-3">
                            <div class="form-check">
                                <p class="order-text-styles"><h4>Всего к оплате: {{ total }} руб. </h4></p>
                            </div>
                        </div>
                    </div>
                </form>
        </div>
    `,
    props: ['url', 'city', 'tires', 'expedition', 'weight', 'floor', 'documents', 'money'],
	data: function () {
		return {
			countOrders: 1,
            From: "",
            To: "",
            address: "",
            fio: "",
            phone: "",
            fenix: "",
            email: "",
            viber: false,
            telegram: false,
            whatsapp: false,
			orders: [
                {
                    "order": "",
                    "amount": "",
                    "weight": "",
                    "len": "",
                    "height": "",
                    "width": "",
                    "sum": "",
                    "description": "",
                    "fragile": 0,
                    "lift": 0,
                    "pLift": 0,
                    "floor_user": "",
                    "type": "cargo",
                    "selectTires": "",
                    "fio_recip": "",
                    "passport": "",
                    "phone_recip": "",
                    "bank": "",
                    "copy": ""
                }
			],
            agreement: false,
            sum: 0
		}
	},
	methods: {
		addOrder: function () {
            this.countOrders++;

            if(this.countOrders < 11){
                this.orders.push(
                    {
                        "order": "",
                        "amount": "",
                        "weight": "",
                        "len": "",
                        "height": "",
                        "width": "",
                        "sum": "",
                        "description": "",
                        "fragile": 0,
                        "lift": 0,
                        "pLift": 0,
                        "floor_user": "",
                        "type": "cargo",
                        "selectTires": "",
                        "fio_recip": "",
                        "passport": "",
                        "phone_recip": "",
                        "bank": "",
                        "copy": ""
                    }
                );
            }
        },
        sendOrder: function () {
            if(this.agreement){
                jsonOrder = this.orders;

                infoClient = {
                    "address": this.address,
                    "fio": this.fio,
                    "phone": this.phone,
                    "fenix": this.fenix,
                    "email": this.email,
                    "viber": this.viber,
                    "telegram": this.telegram,
                    "whatsapp": this.whatsapp
                };
                var data = {
                    "action": "send_order",
                    "order": jsonOrder,
                    "info_client": infoClient,
                    "total": this.total
                };
                this.agreement = false;
                $.post(myajax.url, data, function(response)
                {
                    document.getElementById("notification").textContent = "Заказ успешно отправлен";
                }).fail(function() {
                    document.getElementById("notification").textContent = "Ошибка отправления заказа";
                });
                this.orders.length = 0;
                this.orders = [
                    {
                            "order": "",
                            "amount": "",
                            "weight": "",
                            "len": "",
                            "height": "",
                            "width": "",
                            "sum": "",
                            "description": "",
                            "fragile": 0,
                            "lift": 0,
                            "pLift": 0,
                            "floor_user": "",
                            "type": "cargo",
                            "selectTires": "",
                            "fio_recip": "",
                            "passport": "",
                            "phone_recip": "",
                            "bank": "",
                            "copy": ""
                    }
                ];
            }
        },
        insurance: function (cost) {
		    if(Number(cost) != 0){
                if(Number(cost) * 0.005 < 20)
                    return 20;
                else {
                    return this.round10(Number(cost) * 0.005, 0);
                }
            } else {
		        return 0;
            }
        },
        total_weight: function (len, width_cargo, height, weight_client) {
            total_weight = (len * width_cargo * height)/4000;
            if(total_weight < weight_client)
                total_weight = weight_client;

            if(total_weight > 150)
                total_weight = 150;

            return total_weight;
        },
        total_delivery: function (len, width, height, weight) {
            /*
             * Определяем стоимость транспортировки
             */
            my = this;
            total = 0;
            this.weight.forEach(function(item, i) {
                if((Number(item['destination']) == Number(my.selectedFrom())) && (Number(item['receive']) == Number(my.selectedTo())) && (Number(item['w_min']) < Number(my.total_weight(len, width, height, weight))) && (Number(item['w_max']) >= Number(my.total_weight(len, width, height, weight)))) {
                    total = Number(item['price']);
                }
            });

            return total;
        },
        total_expedition: function (len, width, height, weight, cost) {
            /*
            * Определяем стоимость экспедирования
            */
            my = this;
            total = 0;
            if(cost > 18000)
                salary = 18000;
            else
                salary = cost;
            this.expedition.forEach(function(item, i) {
                if((Number(item['m_min']) < Number(salary)) && (Number(item['m_max']) >= Number(salary)) && (Number(item['w_min']) < Number(my.total_weight(len, width, height, weight))) && (Number(item['w_max']) >= Number(my.total_weight(len, width, height, weight)))) {
                    total = Number(item['price']);
                }
            });

            return total;
        },
        total_floor: function (len, width, height, weight, floor_user, lift, pLift) {
            floor = 0;
            my = this;
            this.floor.forEach(function(item, i) {
                if((Number(item['w_min']) < my.total_weight(len, width, height, weight)) && (Number(item['w_max']) >= my.total_weight(len, width, height, weight))) {
                    floor = Number(item['coef']);
                }
            });
            if((!lift || !pLift) && (floor_user > 0))
                return floor * (floor_user - 1);
            else
                return 0;
        },
        total_floor_tires: function (amount, floor_user, lift, pLift) {
            floor = 0;
            weight = 30 * amount;
            this.floor.forEach(function(item, i) {
                if((Number(item['w_min']) < weight) && (Number(item['w_max']) >= weight)) {
                    floor = Number(item['coef']);
                }
            });
            if((!lift || !pLift) && (floor_user > 0))
                return floor * (floor_user - 1);
            else
                return 0;
        },
        total_fragile: function (fragile) {
            if(fragile)
                return 100;
            else
                return 0;
        },
        total_tires: function (amount, selectTires) {
            my = this;
            total = 0;
            this.tires.forEach(function(item, i) {
                if((Number(item['destination']) == Number(my.selectedFrom())) && (Number(item['receive']) == Number(my.selectedTo())) && (Number(item['tires_size'] == selectTires))) {
                    total = Number(item['price']);
                }
            });

            return total * amount;
        },
        total_documents: function (copy) {
            my = this;

            this.documents.forEach(function(item, i) {
                if((Number(item['destination']) == Number(my.selectedFrom())) && (Number(item['receive']) == Number(my.selectedTo()))) {
                    if(copy == "copy"){
                        total = Number(item['copy']);
                    } else {
                        total = Number(item['original']);
                    }
                }
            });

            return this.round10(total, 0);
        },
        total_money: function (cost) {

            return this.round10(cost * 2.5/100, 0);
        },
        insurance_documents: function (cost, fio, phone, passport) {
		    if((Number(cost) != 0) || (fio!="" && phone!="" && passport != "")){
                if(Number(cost) < 2000)
                    return 10;
                else {
                    return this.round10(Number(cost) * 0.005, 0);
                }
            } else {
                return 0;
            }
        },
        decimalAdjust: function (type, value, exp) {
            // Если степень не определена, либо равна нулю...
            if (typeof exp === 'undefined' || +exp === 0) {
                return Math[type](value);
            }
            value = +value;
            exp = +exp;
            // Если значение не является числом, либо степень не является целым числом...

            if (isNaN(value) || !(typeof exp === 'number' && exp % 1 === 0)) {
                return NaN;
            }

            // Сдвиг разрядов
            value = value.toString().split('e');
            value = Math[type](+(value[0] + 'e' + (value[1] ? (+value[1] - exp) : -exp)));

            // Обратный сдвиг
            value = value.toString().split('e');
            return +(value[0] + 'e' + (value[1] ? (+value[1] + exp) : exp));
        },
        round10: function (value, exp) {
            return this.decimalAdjust('round', value, exp);
        },
        selectedFrom: function () {
            zona = 0;
            my = this;
            if(this.From != '') {
                this.city.forEach(function(item, i) {
                    if(Number(item['id']) == Number(my.From))
                        zona = Number(item['city_zona']);
                });
            }

            return zona;
        },
        selectedTo: function () {
            zona = 0;
            my = this;
            if(this.To != '') {
                this.city.forEach(function(item, i) {
                    if(Number(item['id']) == Number(my.To))
                        zona = Number(item['city_zona']);
                });
            }

            return zona;
        }
    },
	computed: {
        total: function () {
            var sumTotal = 0;
            var isSum = 0;
            for(order in this.orders){
                if(this.orders[order].type == 'cargo') {
                    sumTotal = sumTotal + Number(this.orders[order].sum) + this.total_delivery(Number(this.orders[order].len), Number(this.orders[order].width), Number(this.orders[order].height), Number(this.orders[order].weight)) + this.total_expedition(Number(this.orders[order].len), Number(this.orders[order].width), Number(this.orders[order].height), Number(this.orders[order].weight), Number(this.orders[order].sum)) + this.insurance(Number(this.orders[order].sum)) + this.total_fragile(Number(this.orders[order].fragile)) + this.total_floor(Number(this.orders[order].len), Number(this.orders[order].width), Number(this.orders[order].height), Number(this.orders[order].weight), Number(this.orders[order].floor_user), this.orders[order].lift, this.orders[order].pLift);
                    isSum = isSum + Number(this.orders[order].sum);
                } else if (this.orders[order].type == 'tire'){
                    sumTotal = sumTotal + Number(this.orders[order].sum) + this.total_tires(Number(this.orders[order].amount), Number(this.orders[order].selectTires)) + this.insurance(Number(this.orders[order].sum)) + this.total_fragile(Number(this.orders[order].fragile)) + this.total_floor_tires(Number(this.orders[order].amount), Number(this.orders[order].floor_user), this.orders[order].lift, this.orders[order].pLift);
                    isSum = isSum + Number(this.orders[order].sum);
                } else if(this.orders[order].type == 'document'){
                    sumTotal = sumTotal + this.insurance_documents(Number(this.orders[order].sum), this.orders[order].fio_recip, this.orders[order].phone_recip, this.orders[order].passport) + this.total_documents(this.orders[order].copy);
                } else {
                    sumTotal = sumTotal + Number(this.orders[order].sum) + this.total_money(Number(this.orders[order].sum));
                    isSum = isSum + Number(this.orders[order].sum);
                }

            }

            this.sum = this.round10(isSum, 0);
            return this.round10(sumTotal, 0);
        }
    },
    mounted: function() {
        $(function () {
            $('[data-toggle="popover"]').popover();
        })
    },
    updated: function() {
        $(function () {
            $('[data-toggle="popover"]').popover();
        })
    }
}

// Наш корневой элемент
app = new Vue({
    el: '#app',
    data: {
        view: 'slider',
        trigger: true,
        picked: 'cargo',
        From: '',
        To: '',
        cost: '',
        options: [],
        len: '',
        width_cargo: '',
        height: '',
        weight_client: '',
        copy: "copy",
        visibleCategory: false,
        app_url: WPData.siteurl,
        category: WPData.category,
        products: WPData.products,
        contacts: WPData.contacts,
        about: WPData.about,
        city: WPData.city,
        money: WPData.money,
        weight: WPData.weight,
        expedition: WPData.expedition,
        floor: WPData.floor,
        documents: WPData.documents,
        stores: WPData.stores,
        tires: WPData.tires,
        floor_user: '',
        cat_id: 0,
        searchString: '',
        searchVisible: false,
        COD: 0,
        fragile: 0,
        lift: 0,
        visible: false,
        selectTires: '',
        pLift: false,
        amount: '',
        page: 'description'
    },
    methods: {
        anchor_top: function(event, elem_id) {
            event.preventDefault();
            top1 = $(elem_id).offset().top;
            $('body,html').animate({scrollTop: top1 - (top1*13/100)}, 1500);
        },
        toggle: function (message) {
            this.view = message;
            $('.slider').slick('slickNext');
            $('.navbar-nav>li>a').on('click', function(){
                $('.navbar-collapse').collapse('hide');
            });
            this.$nextTick(function () {
                if (message == "order") {
                    this.anchor_top(event, '#order');
                }
                if (message == "catalog") {
                    this.anchor_top(event, '#catalog');
                }
                if (message == "contact") {
                    this.anchor_top(event, '#contact');
                }
                if (message == "about") {
                    this.anchor_top(event, '#about');
                }
            });

        },
        setCategory: function(catId) {
            this.visibleCategory = true;
            this.cat_id = catId;
        },
        resetCategory: function () {
            this.visibleCategory = false;
        },
        total: function () {

            if(!this.weight_client) {
                alert("Укажите вес груза");
                return false;
            }
            if(this.weight_client > 100) {
                alert("Вес груза не может быть более 100 кг.");
                return false;
            }
            if(!this.selectedFrom) {
                alert("Укажите город отправления");
                return false;
            }
            if(!this.selectedTo) {
                alert("Укажите город назначения");
                return false;
            }
            if(!this.cost) {
                alert("Укажите оценочную стоимость");
                return false;
            }

            this.visible = true;
        },
        totalDocuments: function () {
            if(!this.selectedFrom) {
                alert("Укажите город отправления");
                return false;
            }
            if(!this.selectedTo) {
                alert("Укажите город назначения");
                return false;
            }
            if(!this.cost) {
                alert("Укажите оценочную стоимость");
                return false;
            }

           this.visible = true;
        },
        totalMoney: function () {
            if(!this.selectedFrom) {
                alert("Укажите город отправления");
                return false;
            }
            if(!this.selectedTo) {
                alert("Укажите город назначения");
                return false;
            }
            if(!this.cost) {
                alert("Укажите оценочную стоимость");
                return false;
            }

            this.visible = true;
        },
        totalTires: function () {
            if(!this.selectedFrom) {
                alert("Укажите город отправления");
                return false;
            }
            if(!this.selectedTo) {
                alert("Укажите город назначения");
                return false;
            }
            if(!this.cost) {
                alert("Укажите оценочную стоимость");
                return false;
            }
            if(!this.selectTires) {
                alert("Укажите диаметр");
                return false;
            }

            this.visible = true;
        },
        decimalAdjust: function (type, value, exp) {
            // Если степень не определена, либо равна нулю...
            if (typeof exp === 'undefined' || +exp === 0) {
                return Math[type](value);
            }
            value = +value;
            exp = +exp;
            // Если значение не является числом, либо степень не является целым числом...

            if (isNaN(value) || !(typeof exp === 'number' && exp % 1 === 0)) {
                return NaN;
            }

            // Сдвиг разрядов
            value = value.toString().split('e');
            value = Math[type](+(value[0] + 'e' + (value[1] ? (+value[1] - exp) : -exp)));

            // Обратный сдвиг
            value = value.toString().split('e');
            return +(value[0] + 'e' + (value[1] ? (+value[1] + exp) : exp));
        },
        round10: function (value, exp) {
            return this.decimalAdjust('round', value, exp);
        }
    },
    computed: {
        product: function() {
            if(this.cat_id == 0)
                return  this.products;
            else {
                var filterArr = this.products.filter(function(item, i) {
                        if(item.category_id == this.cat_id)
                            return true;
                        else
                            return false;
                }, this);
                return filterArr;
            }
        },
        filteredArticles: function () {
            var articles_array = this.products,
                searchString = this.searchString;

            if(!searchString){
                this.searchVisible = false;
                return '';
            }
            this.searchVisible = true;
            searchString = searchString.trim().toLowerCase();

            articles_array = articles_array.filter(function(item){
                if(item.name.toLowerCase().indexOf(searchString) !== -1){
                    return true;
                } else {
                    if(item.category_name.toLowerCase().indexOf(searchString) !== -1){
                        return true;
                    }
                }
            });

            // Возвращает массив с отфильтрованными данными.

            return articles_array;
        },
        total_floor: function () {
            floor = 0;
            my = this;
            this.floor.forEach(function(item, i) {
                if((Number(item['w_min']) < my.total_weight) && (Number(item['w_max']) >= my.total_weight)) {
                   floor = Number(item['coef']);
                }
            });
            if((!this.lift || !this.pLift) && (this.floor_user > 0))
                return floor * (this.floor_user - 1);
            else
                return 0;
        },
        total_floor_tires: function () {
            floor = 0;
            weight = 30 * this.amount;
            this.floor.forEach(function(item, i) {
                if((Number(item['w_min']) < weight) && (Number(item['w_max']) >= weight)) {
                    floor = Number(item['coef']);
                }
            });
            if((!this.lift || !this.pLift) && (this.floor_user > 0))
                return floor * (this.floor_user - 1);
            else
                return 0;
        },
        insurance: function () {
            if(this.cost * 0.005 < 20)
                return 20;
            else {
                return this.round10(this.cost * 0.005, 0);
            }
        },
        insurance_documents: function () {
            if(this.cost < 2000)
                return 10;
            else {
                return this.round10(this.cost * 0.005, 0);
            }
        },
        total_fragile: function () {
            if(this.fragile)
                return 100;
            else
                return 0;
        },
        total_weight: function () {
                total_weight = (this.len * this.width_cargo * this.height)/4000;
                if(total_weight < this.weight_client)
                    total_weight = this.weight_client;

                if(total_weight > 150)
                    total_weight = 150;

                return total_weight;
        },
        total_delivery: function () {
           /*
            * Определяем стоимость транспортировки
            */
            my = this;
            total = 0;
            this.weight.forEach(function(item, i) {
                if((Number(item['destination']) == Number(my.selectedFrom)) && (Number(item['receive']) == Number(my.selectedTo)) && (Number(item['w_min']) < Number(my.total_weight)) && (Number(item['w_max']) >= Number(my.total_weight))) {
                    total = Number(item['price']);
                }
            });

            return total;
        },
        total_expedition: function () {
            /*
            * Определяем стоимость экспедирования
            */
            my = this;
            total = 0;
            if(this.cost > 18000)
                salary = 18000;
            else
                salary = this.cost;
            this.expedition.forEach(function(item, i) {
                if((Number(item['m_min']) < Number(salary)) && (Number(item['m_max']) >= Number(salary)) && (Number(item['w_min']) < Number(my.total_weight)) && (Number(item['w_max']) >= Number(my.total_weight))) {
                    total = Number(item['price']);
                }
            });

            return total;
        },
        total_documents: function () {
            my = this;

            this.documents.forEach(function(item, i) {
                if((Number(item['destination']) == Number(my.selectedFrom)) && (Number(item['receive']) == Number(my.selectedTo))) {
                    if(my.copy == "copy"){
                        total = Number(item['copy']);
                    } else {
                        total = Number(item['original']);
                    }
                }
            });

            return this.round10(total, 0);
        },
        total_money: function () {

            return this.round10(this.cost * 2.5/100, 0);
        },
        total_tires: function () {
            my = this;
            total = 0;
            this.tires.forEach(function(item, i) {
                if((Number(item['destination']) == Number(my.selectedFrom)) && (Number(item['receive']) == Number(my.selectedTo)) && (Number(item['tires_size'] == my.selectTires))) {
                    total = Number(item['price']);
                }
            });

            return this.round10(total * this.amount, 0);
        },
        selectedFrom: function () {
            zona = 0;
            my = this;
            if(this.From != '') {
                this.city.forEach(function(item, i) {
                    if(Number(item['id']) == Number(my.From))
                        zona = Number(item['city_zona']);
                });
            }

            return zona;
        },
        selectedTo: function () {
            zona = 0;
            my = this;
            if(this.To != '') {
                this.city.forEach(function(item, i) {
                    if(Number(item['id']) == Number(my.To))
                        zona = Number(item['city_zona']);
                });
            }

            return zona;
        },
        background: function () {
            var ratio = window.devicePixelRatio || 1;
            var w = screen.width * ratio;
            var h = screen.height * ratio;

            if(screen.width > 1025) {
                if(this.cat_id < 3)
                    return "background: url(" + this.app_url  + "/image/store/img-full-3.png) right center no-repeat";
                return "background: url(" + this.app_url  + "/image/store/img-full-" + this.cat_id + ".png) right center no-repeat";
            } else {
                return "background: none";
            }
        }
    },
    updated: function () {

    },
    mounted: function() {

    },
    components: {
        // будет доступен только в шаблоне родителя
        'app-about': About,
        'app-contact': Contact,
        'app-catalog': Catalog,
        'app-order': Order
    }
});

Vue.config.devtools = false;