<template>
  <div class="about-content-styles" align="justify">
    <p class="text-center">ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ</p>
    Настоящее Соглашение пользователя (далее «Соглашение») заключается между Вами (далее «Пользователь») и ООО «Восток-Экспрес» (далее «Администратор») и регулирует все виды использования сайта http://vostok-exp.com (далее «Сайт»), включая все его под-домены, который является собственностью и  управляется ООО «Восток-Экспрес».
    <br><br>
    <ol>
      <li>Общие положения</li>
    </ol>
    1.1. Использование сайта разрешено только лицу (далее «Пользователь»), что приняло все условия настоящего Соглашения, размещенной по адресу, http://vostok-exp.com «Соглашение о конфиденциальности», которая размещена по адресу http://vostok-exp.com и другие правила, предусмотренные на Сайте.<br>
    1.2. Пользователь обязан внимательно ознакомиться с Соглашением перед использованием Сайта. Используя любую часть Сайта, Пользователь дает свое согласие быть связанным условиями настоящего Соглашения с ООО «Восток-Экспрес».<br>
    Если Вы не согласны с условиями Соглашения (полностью или частично), то Вам не предоставляется статус и права пользователя и Вам запрещается использовать Сайт, включая, но не ограничиваясь, любую информацию, размещенную на Сайте и любые сервисы, предоставляемые в рамках Сайта.<br>
    1.3. Условия Соглашения распространяются на всех пользователей сайта - как на пользователей, не имеющих учетной записи на Сайте (незарегистрированный пользователь), так и на пользователей, имеющих любую учетную запись, любого из доступных видов. Под учетной записью понимается совокупность информации о
    пользователя и данных авторизации (логин, пароль).<br>
    1.4. Пользователь не имеет права использовать Сайт и не может принять условия Соглашения, если он не достиг установленного законом возраста, когда он имеет право заключать такие соглашения.<br>
    1.5. Доступ к персонализированным сервисам Сайта возможен только для зарегистрированного пользователя (что создал учетную запись) и с использованием данных авторизации.<br>
    1.6. Информация, содержащаяся на Сайте в виде отчетов, новостей, пресс-релизов и других информационных материалов, является актуальной на дату их составления. В связи с последующими событиями и по истечению времени некоторая информация может оказаться неполной или такой, что не соответствует действительности, однако после ее публикации ООО «Восток-Экспрес» не гарантирует оперативного изменения такой информации в связи с событиями, произошедшими.<br>
    1.7. На Сайте может содержаться информация о проектах, прогнозы или заявления, касается будущих мероприятий http://vostok-exp.com В связи с этим Стороны соглашаются с тем, что такая информация носит предварительный характер и действительные события и обстоятельства могут существенно отличаться в результате воздействия различных факторов.<br>
    <br>
    <ol start="2">
      <li>Права, обязанности и ответственность сторон</li>
    </ol>
    2.1. Если Пользователь считает, что на Сайте присутствует информация, нарушающая его права, Пользователь обязан сообщить об этом ООО «Восток-Экспрес» и предоставить ему информацию, которая подтверждает данное нарушение прав. В случае если Пользователь предоставит ложную информацию о нарушении его прав, он
    несет полную ответственность за причиненный ущерб (включая расходы, пошлины и оплату адвокатских услуг).
    <br>
    2.2. Пользователю запрещается:
    <ul>
      <li>создавать несколько учетных записей на Сайте, если фактически они принадлежат одному и тому же лицу;</li>
      <li>совершать действия, направленные на введение других пользователей в заблуждение;</li>
      <li>предоставлять в пользование свою учетную запись и / или логин и пароль от учетной записи третьим лицам;</li>
      <li>регистрировать аккаунт от имени или вместо другого лица;</li>
      <li>использовать любые компьютерные программы для автоматизированного сбора информации на Сайте;</li>
      <li>осуществлять незаконный сбор, систематизацию, хранение или распространение персональной информации других пользователей;</li>
      <li>пытаться получить доступ к учетной записи и / или логина и пароля другого пользователя любым способом, включая, но не ограничиваясь, путем обмана, злоупотребления доверием, подбора логина и пароля;</li>
      <li>размещать информацию (включая любые материалы), что нарушает авторские права, права на знаки для товаров и услуг, права промышленной собственности и / или права на иные объекты интеллектуальной собственности, принадлежат ДЦ и / или третьим лицам;</li>
      <li>размещать информацию, нарушающую права и законные интересы третьих лиц (В том числе, размещение фотографий и видеороликов, основным объектом которых человек, если этот человек не давала согласия на размещение на Сайте фотографии или видео с ее участием)</li>
      <li>размещать материалы рекламного, эротического, порнографического или оскорбительного характера;</li>
      <li>способствовать или разжигать религиозную, расовую  или межнациональную вражду;</li>
      <li>совершать действия, нарушающие права и свободы, честь и достоинство любого лица;</li>
      <li>оскорблять любого;</li>
      <li>использовать нецензурные выражения, даже если они маскируются другими символами (например звездочками);</li>
      <li>выходить за рамки заранее установленной темы Анкеты и диалога с пользователем:</li>
      <li>злоупотреблять размещением информации, которая не несет смысловой нагрузки;</li>
      <li>провоцировать, начинать и / или поддерживать текстовые диалоги, которые могут привести к конфликту между Пользователями и / или Администрацией Сайта • размещать компьютерные вирусы или программы, способные прервать или нарушить нормальную функциональность компьютерного оборудования и программного обеспечения, а также средств телекоммуникации любых человек.</li>
    </ul>
    2.3. Ответственность пользователей:
    <ul>
      <li>любые действия, совершенные с использованием учетной записи и / или его логина и пароля пользователя, считаются осуществленными этим Пользователем;</li>
      <li>за нарушение условий настоящего Соглашения, ООО «Восток-Экспрес» имеет право без предварительного уведомления блокировать доступ Пользователя к Сайту и / или удалить учетную запись пользователя;</li>
      <li>в случае размещения Пользователем на Сайте информации или осуществления других действий, не соответствующих условиям Соглашения, ООО «Восток-Экспрес» имеет право без уведомления по собственному усмотрению удалить полностью или частично размещенную Пользователем информацию, включая ту информацию, в отношении которой трудно определить ее соответствие Соглашению и / или законодательству, применяется;</li>
      <li>Пользователь самостоятельно отвечает за любое использование информации опубликованной на Сайте.</li>
    </ul>
    2.4. Ответственность ООО «Восток-Экспрес»:
    <ul>
      <li>не принимает на себя обязательств по принятию заказа превышающего  рублевый эквивалент,  равный 1 000.00 дол. США  и весом более 100 кг;</li>
      <li>не несет ответственности и не возмещает ущерб, прямой или косвенный, причиненный Пользователю или третьим лицам в результате невозможности использования сайта;</li>
      <li>не несет ответственности за содержание сайтов, не принадлежащие ей ссылку на которые могут присутствовать на Сайте, и не гарантирует их доступности, корректной работы и соответствия заявленной тематике;</li>
      <li>не принимает на себя обязательств по проверке, изменению и контроля информации, расположенной кем-либо, кроме ООО «Восток-Экспрес» на Сайте, не гарантирует и не несет ответственности за достоверность такой информации, ее законность, качество и соответствие конкретным запросам и потребностям Пользователей Сайта;</li>
      <li>не несет ответственности за использование третьими лицами информации, размещенной Пользователем на Сайте, включая ее копирование, воспроизведение и распространение, осуществленные как в рамках Сайта, так и иными возможными способами.</li>
    </ul>
    <ol start="3">
      <li>Интеллектуальная собственность</li>
    </ol>
    3.1. Настоящее Соглашение не передает Пользователю никаких имущественных прав на любые объекты интеллектуальной собственности ООО «Восток-Экспрес» или третьих лиц, если это явно не указано, и все права собственности в отношении такой собственности остаются исключительно за ООО «Восток-Экспрес» и / или соответствующей третьим лицом.<br>
    3.2. Пользователю запрещено любое использование в коммерческих целях любой информации и объектов интеллектуальной собственности, которые размещены на Сайте, без письменного разрешения на это соответствующего правообладателя.<br>
    3.3. При любом разрешенном использовании Пользователем информации, размещена на Сайте, Пользователь обязан хранить все авторские ссылки, имеющихся в информационных материалах, и указывать авторство и ссылка на сайт в каждом отдельном случае использования информации и произведений.<br>
    3.4. Пользователь, размещает на Сайте любую информацию, которая содержит объекты интеллектуальной собственности, включая, но не ограничиваясь, текст, графические изображения, аудио и видео продукцию, компьютерные программы, базы данных, знаки для товаров и услуг и т.д., гарантирует, что загрузка на Сайт, копирование и использование данной информации и / или объектов интеллектуальной собственности,<br>
    содержатся в ней, не будет нарушать прав третьих лиц.<br>
    3.5. Пользователь, загружая на сайт любые объекты интеллектуальной собственности, безвозмездно предоставляет ООО «Восток-Экспрес» неисключительные имущественные права на эти объекты, при условии их использования на некоммерческих основаниях. Предоставляемые Пользователем ООО «Восток-Экспрес» имущественные права не имеют территориального ограничения и предоставляются на весь срок действия авторских прав. Данные имущественные права включают в себя право на: воспроизведение произведений, публичное исполнение и публичное оповещение произведений, публичную демонстрацию и публичный показ, осуществление перевода, переработки, адаптации, аранжировки и другие подобные изменения произведений, включение произведений как составных частей в сборники, представление произведений в всеобщего сведения публики таким образом, что ее представители могут осуществить доступ к произведениям с любого места и в любое время по их собственному выбору.<br>
    <br>
    <ol start="4">
      <li>Конфиденциальность</li>
    </ol>
    4.1. Пользователь подтверждает, что он ознакомился и полностью принял условия «Соглашения о конфиденциальности» между Пользователем и ООО «Восток-Экспрес», которая размещена по адресу  http://vostok-exp.com<br>
    4.2. В случае, если при использовании Сайта Пользователю любым способом стала известна информация относительно ООО «Восток-Экспрес» и / или третьих лиц, которая в соответствии с законодательством  относится к конфиденциальной и / или Коммерческой тайны, Пользователю запрещено хранить, использовать и<br>
    распространять такую информацию.<br>
    4.3. Пользователь понимает и соглашается с тем, что размещая на Сайте информацию, в отношении которой не предусмотрено ограничение доступа, любое третье лицо может получить доступ к этой информации с помощью сети Интернет.<br>
    <br>
    <ol start="5">
      <li>Другие условия</li>
    </ol>
    5.1. ООО «Восток-Экспрес» имеет право вносить изменения в настоящее Соглашение. Все внесенные в Соглашение изменения будут доступны в виде новой редакции Соглашения, по адресу http://vostok-exp.com  В случае внесения в Соглашение существенных изменений, ООО «Восток-Экспрес» дополнительно сообщит Пользователя об этих изменениях по электронной почте, указанной Пользователем в аккаунте, и на сайте. Все изменения<br>
    Соглашения вступают в силу с момента их опубликования. Используя услуги или Сайт, Пользователь подтверждает согласие с новыми условиями Соглашения в действующей  редакции на момент использования Пользователем услуг или Сайта.<br>
    5.2. ООО «Восток-Экспрес» не несет ответственности за ущерб или убытки, которые понес Пользователь или третьи лица в результате ошибочного понимания или непонимание условий настоящего Соглашения, инструкций или указаний о порядке использования сайта, относительно порядка размещения данных и других технических вопросов.<br>
    5.3. Пользователь предоставляет ООО «Восток-Экспрес» право присылать ему сообщения содержащие информацию о Сайте, товарах  и услугах  ООО «Восток-Экспрес» или информацию рекламного характера.<br>
    5.4. В случае признания недействительной или неосуществимой любой части данного Соглашения, другие части Соглашения будут оставаться в силе. Отказ каждой из сторон от любого положения или условия данного Соглашения, или любое их нарушение не отменяет действие этого положения или условия.<br>
    5.5. Сайт предоставляется ООО «Восток-Экспрес» пользователям в том виде, в котором он был создан для достижения целей ООО «Восток-Экспрес». ООО «Восток-Экспрес» не гарантирует соответствие Сайта целям и ожиданиям Пользователя, его бесперебойную и безошибочную работу.<br>
    5.6. ООО «Восток-Экспрес» имеет право в одностороннем порядке изменять виды сервисов в рамках сайта.<br>
    5.7. ООО «Восток-Экспрес» может в любой момент и без уведомления Пользователя уступить свои права по данному Соглашению третьей стороне.<br>
    5.8. В настоящее Соглашение и отношениям между ООО «Восток-Экспрес» и Пользователем, возникающие в связи с использованием Сайта,  применяется законодательство ДНР.<br>
  </div>
</template>