<template>
  <div>
    <p align="justify">Добро пожаловать на наш сайт!</p>
    Здесь вы сможете самостоятельно выбрать необходимый товар прямо из интернет-магазинов России, при этом экономя свои деньги и не переплачивая за товар. Хотите приобрести бытовую технику, мебель, хозяйственные и строительные товары, электронику, а так же <span class="text-danger">отправить гарантийную технику на ремонт в сервисный центр РФ</span>  или что-то еще? Тогда вы зашли по адресу! Наша цель – максимально упростить и удешевить процесс покупки, сделать его простым, удобным и выгодным! Наша команда следует четко установленному девизу: «Быстро, удобно и без переплат». Обратите внимание, что товар Вы покупаете по цене, которая указана в прайсе магазина. Приобретайте товары на нашем сайте, не выходя из дома, а наш курьер своевременно доставит Ваш заказ по указанному Вами адресу. Если при выборе товара у Вас возникнут вопросы – звоните или пишите нам! Мы дадим консультацию по любому Вашему вопросу!<br>
    Удачных покупок!
  </div>
</template>
