<template>
  <p class="text-left">
    1. Из любого банка, банковского терминала или  платежной системы перечислите необходимую сумму на реквизиты vostok-exp.com (карта СберБанка)*: Номер карты Вы можете запросить у нашего менеджера на сайте или по телефонам.<br>
    <span class="text-danger">* комиссия банка, снимаемая при переводе, оплачивается Вами, согласно тарифам Вашего банка или платежной системы.</span><br>
    2. После отправки денежных средств ОБЯЗАТЕЛЬНО зарегистрируйте свое денежное отправление в форме <router-link class="text-danger" :to="{ name: 'order' }">оформления заказа</router-link>.<br>
    3. Выдача денежных средств осуществляется в <router-link class="text-danger" :to="{ name: 'contact' }">офисе vostok-exp.com</router-link> (пн-пт с 9:00 до 17:00).<br><br>
    Консультация по отправлению денежных средств из России можно получить у онлайн оператора или по телефонам, указанным на сайте.<br>
    Расчет стоимости услуги Доставка можно рассчитать, воспользовавшись нашим <a class="text-danger" href="javascript:void(0)" onclick="$('#modal').modal()">КАЛЬКУЛЯТОРОМ</a> .
  </p>
</template>
