<template>
  <div>
    <p><h4 class="about-text-left">Товары, запрещенные к перемещению</h4></p>
    <ol>
      <li>Ювелирные изделия, драгоценные металлы и камни.</li>
      <li>Антиквариат.</li>
      <li>Наркотические вещества и психотропные препараты, их аналоги и прекурсоры, которые подлежат специальному контролю.</li>
      <li>Огнестрельное оружие и его части, боеприпасы.</li>
      <li>Асбест; огнеопасные, легковоспламеняющиеся и взрывные вещества, радиоактивные вещества, другие опасные грузы, с соответствующей маркировкой («невоспламеняющиеся газы», «окислитель», «инфекционные вещества», «самовозгорающиеся вещества», «яд», «радиоактивные вещества», «опасные вещества, при увлажнении», «вредные вещества», «ядовитый газ»).</li>
      <li>Баллоны с жидкостью и газом.</li>
      <li>Автомобильные аккумуляторы, аккумуляторы для мото- и с/х техники.</li>
      <li>Порнографические материалы.</li>
      <li>Животные (останки животных) и растения.</li>
      <li>Продукты питания (скоропортящиеся продукты).</li>
      <li>Грузы, которые требуют специального температурного режима.</li>
      <li>Лекарственные препараты.</li>
      <li>Грузы, которые имеют резкий запах, грязные и могут нанести вред другим грузам или нанести вред здоровью людей.</li>
      <li>Товары и предметы, запрещенные Таможенным законодательством РФ.</li>
    </ol>
  </div>
</template>
